libs/@hashintel/brunch-agent/docs/evidence/implementations/fe-1573-step-a/passage-policy/final-mutant-carry-empty.diff
--- passage-policy.integration.ts
+++ passage-policy-carry-empty.temporary.ts
@@ -338,7 +338,7 @@
       assert.equal(actual.currentWorkpiece.ordinal, previous.ordinal + 1);
       assert.deepEqual(
         actual.currentWorkpiece.evidence,
-        declaration ? evidence : expected,
+        declaration ? evidence : [],
       );
       assert.equal(
         actual.currentWorkpiece.evidenceValidated,
