libs/@hashintel/brunch-agent/docs/evidence/implementations/fe-1573-step-a/passage-policy/final-mutant-later-lookup-hash.diff
--- passage-policy.integration.ts
+++ passage-policy-later-lookup-hash.temporary.ts
@@ -332,7 +332,7 @@
     call("brunch_workpiece", { locateTexts: queries }, `${prefix}-read`),
     (context) => {
       actual = modelOutput(context, `${prefix}-read`);
-      checkLookup(actual, markdown, `${prefix}-revision`);
+      assert.equal(actual.locatorLookup.sha256, sha256("WRONG CONTENT"));
       assert.equal(actual.currentWorkpiece?.markdown, markdown);
       assert.equal(actual.currentWorkpiece.sha256, sha256(markdown));
       assert.equal(actual.currentWorkpiece.ordinal, previous.ordinal + 1);
