libs/@hashintel/brunch-agent/docs/evidence/implementations/fe-1573-step-a/passage-policy/mutant-lookup-hash.diff
--- passage-policy.integration.ts
+++ passage-policy-lookup-hash.temporary.ts
@@ -114,7 +114,7 @@
   markdown: string,
   revisionId?: string,
 ) => {
-  assert.equal(read.locatorLookup.sha256, sha256(markdown));
+  assert.equal(read.locatorLookup.sha256, sha256("WRONG CONTENT"));
   assert.equal(read.locatorLookup.utf16Length, markdown.length);
   assert.deepEqual(
     read.locatorLookup.subject,
